---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.NoSupported2DElementsToCopyFromView
source: html/e16ac190-df60-3559-c9e1-dbd6b069958d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.NoSupported2DElementsToCopyFromView Property

None of the elements in the view you have selected are supported for the insert 2D operation.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSupported2DElementsToCopyFromView { get; }
```